# №3.1[17]. Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Примечание: Пользователь может вводить значения списка или список задан изначально.
# Примеры/Тесты:
# [1, 1, 2, 0, -1, 3, 4, 4] -> 6
# [1, 1, 2, 0, 1, 2, 1, 2] -> 3

# list1 = [1, 1, 2, 0, 1, 2, 1, 2]
# list2 = []

# for i in list1:
#     if i not in list2:
#          list2.append(i)
# print(len(list2)) 

# №3.2[19]. Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо, K – положительное число.
# Примечание: Пользователь может вводить значения списка или список задан изначально.
# Примеры/Тесты:
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]
list1 = [1, 2, 3, 4, 5]
list2 = []
k = 3

for k in list1:
    print(k)
